TeddyWiz/HT_STM32L496_TEST/HT_STM32L496_TEST/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define FLASH_CS_Pin GPIO_PIN_4
#define FLASH_CS_GPIO_Port GPIOA
#define NFC_VOUT_Pin GPIO_PIN_2
#define NFC_VOUT_GPIO_Port GPIOB
#define NRESET_Pin GPIO_PIN_8
#define NRESET_GPIO_Port GPIOD
#define NETLIGHT_Pin GPIO_PIN_9
#define NETLIGHT_GPIO_Port GPIOD
#define MCU_RUN_Pin GPIO_PIN_10
#define MCU_RUN_GPIO_Port GPIOD
#define PWRKEY_Pin GPIO_PIN_11
#define PWRKEY_GPIO_Port GPIOD
#define RF_POWER_Pin GPIO_PIN_15
#define RF_POWER_GPIO_Port GPIOD
#define SENSE_PV_Pin GPIO_PIN_6
#define SENSE_PV_GPIO_Port GPIOC
#define SENSE_CRITICAL_Pin GPIO_PIN_7
#define SENSE_CRITICAL_GPIO_Port GPIOC
#define SENSE_WARNING_Pin GPIO_PIN_8
#define SENSE_WARNING_GPIO_Port GPIOC
#define SENSE_TC_Pin GPIO_PIN_9
#define SENSE_TC_GPIO_Port GPIOC
#define ENABLE_FLASH_Pin GPIO_PIN_8
#define ENABLE_FLASH_GPIO_Port GPIOA
#define FD_Pin GPIO_PIN_3
#define FD_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
